# BadMirror Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MirrorFailures..::..BadMirror Property
BuiltInFailures..::..MirrorFailures Class See Also
---
Can't mirror element into this position.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadMirror { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadMirror As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadMirror {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MirrorFailures Class
Autodesk.Revit.DB Namespace